# Posttest KB 2: EDA dan Dataset
## Import library Pandas dan Numpy

df = pd.read_csv("Top 2000 Universities of the World.csv"); berfungsi untuk membaca dataset pada file CSV.

In [1]:
import numpy as np
import pandas as pd
df = pd.read_csv("Top 2000 Universities of the World.csv")
df.head(5)

,World Rank,Institution,Country,National Rank,Quality of Education Rank,Alumni Employment Rank,Quality of Faculty Rank,Research Performance Rank,Score
0,1,Harvard University,USA,1,1,1,1,1,100.0
1,2,Massachusetts Institute of Technology,USA,2,4,12,2,8,96.7
2,3,Stanford University,USA,3,10,4,3,2,95.1
3,4,University of Cambridge,United Kingdom,1,3,25,4,10,94.1
4,5,University of Oxford,United Kingdom,2,7,27,9,4,93.3

# Ketentuan 1 Posttest 2
## Informasi yang didapatkan adalah jumlah record, nama attribute, jumlah attribute dengan tipe objek, jumlah attribute dengan tipe angka, jumlah attribute yang memiliki nilai null.

df.shape = untuk mengetahui jumlah record

df.colums = untuk mengetahui jumlah nama atribut

df.select_dtypes(include=object).columns = untuk mengetahui jumlah attribute dengan tipe objek

df.select_dtypes(include=np.number).columns = untuk mengetahui jumlah attribute dengan tipe angka

df.isna().any() = untuk mengetahui apakah terdapat attribute yang memiliki nilai null

df.loc[:, null].columns = untuk menampilkan kolom sesuai lokasi yang ditentukan

In [2]:
record = df.shape[0]
atribut = df.columns
objek = df.select_dtypes(include=object).columns
angka = df.select_dtypes(include=np.number).columns
null = df.isna().any()
nilai_null = df.loc[:, null].columns

# Ketentuan 2 Posttest 2
## Masukkan informasi di atas dalam dictionary dengan key sesuai nama informasinya. Tampilkan isi dari dictionary tersebut sebagus mungkin.

In [4]:
info = {
    'jumlah_record':record,
    'nama_atribut':atribut,
    'atribut_objek':objek,
    'atribut_angka':angka,
    'atribut_null':nilai_null
}

print("Jumlah Record \t\t\t\t:", info['jumlah_record'])
print("Jumlah Nama Atribut \t\t\t:", len(info['nama_atribut']))
print("Jumlah Atribut dengan Tipe Objek \t:", len(info['atribut_objek']))
print("Jumlah Atribut dengan Tipe Angka \t:", len(info['atribut_angka']))
print("Jumlah Atribut yang Memiliki Nilai Null :", len(info['atribut_null']))
print(" ")
print("=====================================================")
print("                      Posttest 2                     ")
print("      Menampilkan isi Dictionary dari Ketentuan 1    ")
print("=====================================================")

print("Informasi 1\n\nJumlah Record pada DATASET               : ", info.get('jumlah_record'))
print("=====================================================")
print("Informasi 2\n\nJumlah Nama Atribut pada DATASET         : ")
for i in range (len(info["nama_atribut"])):
    print(info["nama_atribut"][i])
    i+=1
print("=====================================================")
print("Informasi 3\n\nJumlah Atribut dengan Tipe Objek         : ", len(info['atribut_objek']))
print("=====================================================")
print("Informasi 4\n\nJumlah Atribut dengan Tipe Angka         : ", len(info['atribut_angka']))
print("=====================================================")
print("Informasi 5\n\nJumlah Atribut yang Memiliki Nilai Null  : ", len(info['atribut_null']))
print("-----------------------------------------------------")

Jumlah Record 				: 2000
Jumlah Nama Atribut 			: 9
Jumlah Atribut dengan Tipe Objek 	: 6
Jumlah Atribut dengan Tipe Angka 	: 3
Jumlah Atribut yang Memiliki Nilai Null : 0

=====================================================
                      Posttest 2
      Menampilkan isi Dictionary dari Ketentuan 1
=====================================================
Informasi 1

Jumlah Record pada DATASET               :  2000
=====================================================
Informasi 2

Jumlah Nama Atribut pada DATASET         :
World Rank
Institution
Country
National Rank
Quality of Education Rank
Alumni Employment Rank
Quality of Faculty Rank
Research Performance Rank
Score
=====================================================
Informasi 3

Jumlah Atribut dengan Tipe Objek         :  6
=====================================================
Informasi 4

Jumlah Atribut dengan Tipe Angka         :  3
=====================================================
Informasi 5

Jumlah Atribut yang Memiliki Nilai Null  :  0
-----------------------------------------------------

# Ketentuan 3 Posttest 2
## Menampilkan rata - rata, standar deviasi, nilai minimum, nilai maksimum, Q1, Q2, dan Q3 dari attribute bertipe angka.

In [43]:
df.describe(include=[np.number])

        World Rank  National Rank        Score
count  2000.000000    2000.000000  2000.000000
mean   1000.500000      67.523000    71.586450
std     577.494589      83.128615     5.079795
min       1.000000       1.000000    65.700000
25%     500.750000      10.000000    67.700000
50%    1000.500000      33.000000    70.200000
75%    1500.250000      86.000000    74.100000
max    2000.000000     347.000000   100.000000

# Ketentuan 4 Posttest 2
## Menampilkan nilai korelasi attribute bertipe angka.

In [7]:
print (df.corr())

               World Rank  National Rank     Score
World Rank        1.00000       0.344200 -0.916950
National Rank     0.34420       1.000000 -0.329112
Score            -0.91695      -0.329112  1.000000

# Ketentuan 5 Posttest 2
## Mengubah nilai salah satu attribute bertipe angka (Score) menjadi bilangan bulat

In [8]:
df = df.fillna(0)
df.Score = df.Score.astype(int)
df.head(10)

,World Rank,Institution,Country,National Rank,Quality of Education Rank,Alumni Employment Rank,Quality of Faculty Rank,Research Performance Rank,Score
0,1,Harvard University,USA,1,1,1,1,1,100
1,2,Massachusetts Institute of Technology,USA,2,4,12,2,8,96
2,3,Stanford University,USA,3,10,4,3,2,95
3,4,University of Cambridge,United Kingdom,1,3,25,4,10,94
4,5,University of Oxford,United Kingdom,2,7,27,9,4,93
5,6,Princeton University,USA,4,5,15,7,70,92
6,7,Columbia University,USA,5,11,14,10,15,92
7,8,University of Chicago,USA,6,8,16,27,22,91
8,9,University of Pennsylvania,USA,7,14,10,42,12,91
9,10,Yale University,USA,8,6,36,13,20,90

# Ketentuan 6 Posttest 2
## Menampilkan 10 record pertama dari attribute bertipe angka.

In [9]:
df[['World Rank', 'National Rank', 'Score']].head(10)

   World Rank  National Rank  Score
0           1              1    100
1           2              2     96
2           3              3     95
3           4              1     94
4           5              2     93
5           6              4     92
6           7              5     92
7           8              6     91
8           9              7     91
9          10              8     90

# Ketentuan 7 Posttest 2
## Simpan dataset dengan attribute bertipe angka ke dalam file CSV.

In [10]:
df[['World Rank', 'National Rank', 'Score']].to_csv("Top 2000 University of the World.csv")